"Domains" = "Domains";
"Added Domains" = "Added Domains";
"Add Domain" = "Add Domain";
"Searching for services" = "Searching for services…";
"Searching for web services" = "Searching for web services…";
